update daigram
